In [1]:
people = {
    'first': ['Dinesh', 'Hardik', 'Bishnu'],
    'last': ['Paudel', 'Paudel', 'Dhakal'],
    'email': ['dnespaudel@gmail.com', 'hardikkhanl@gmail.com', 'bishnudhakal@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first    last                   email
0  Dinesh  Paudel    dnespaudel@gmail.com
1  Hardik  Paudel   hardikkhanl@gmail.com
2  Bishnu  Dhakal  bishnudhakal@gmail.com

In [16]:
filt = (df['last'] == 'Dhakal') | (df['first'] == 'Dinesh')

In [18]:
df.loc[~filt]

    first    last                  email
1  Hardik  Paudel  hardikkhanl@gmail.com

In [22]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [20]:
df.columns = ['first_name', 'last_name', 'email']

In [24]:
df

  FIRST_NAME LAST_NAME                   EMAIL
0     Dinesh    Paudel    dnespaudel@gmail.com
1     Hardik    Paudel   hardikkhanl@gmail.com
2     Bishnu    Dhakal  bishnudhakal@gmail.com

In [30]:
df.columns = [x.lower() for x in df.columns]

In [28]:
df.columns = df.columns.str.replace(' ', '_')

In [31]:
df

  first_name last_name                   email
0     Dinesh    Paudel    dnespaudel@gmail.com
1     Hardik    Paudel   hardikkhanl@gmail.com
2     Bishnu    Dhakal  bishnudhakal@gmail.com

In [33]:
df.rename(columns = {'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [34]:
df

    first    last                   email
0  Dinesh  Paudel    dnespaudel@gmail.com
1  Hardik  Paudel   hardikkhanl@gmail.com
2  Bishnu  Dhakal  bishnudhakal@gmail.com

In [ ]:
df.loc[2
      ]